tmp/package_build/FinanceHub_Complete_Package_v6.0.0_20250809_194813/tests/load/api-load-test.yml
config:
  target: 'http://localhost:5000'
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 10
      name: "Steady load"
    - duration: 60
      arrivalRate: 20
      name: "Peak load"
  defaults:
    headers:
      Content-Type: 'application/json'

scenarios:
  - name: "Dashboard API Load Test"
    weight: 40
    flow:
      - get:
          url: "/api/macroeconomic-indicators"
          capture:
            - json: "$.indicators[0].metric"
              as: "firstMetric"
      - think: 2
      - get:
          url: "/api/momentum-analysis"
      - think: 1
      - get:
          url: "/api/health/system-status"

  - name: "Economic Data API Load Test"
    weight: 30
    flow:
      - get:
          url: "/api/macroeconomic-indicators?deltaZScore=1"
      - think: 3
      - get:
          url: "/api/recent-economic-openai"

  - name: "Technical Analysis Load Test"
    weight: 20
    flow:
      - get:
          url: "/api/technical"
      - think: 2
      - get:
          url: "/api/market-sentiment"

  - name: "Health Check Load Test"
    weight: 10
    flow:
      - get:
          url: "/health/system-status"
      - get:
          url: "/health/data-integrity/validate"